In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("./dataset/Employee_Dataset.csv")
df.head()

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
0,EMP1000,IT,Senior Analyst,60,85000,invalid,01/04/2021,5,3,NaN
1,emp_1,IT,Analyst,NaN,55000,10/06/2020,invalid,5,3,True
2,EMP1002,Sales,NaN,28,85000,NaN,2022-03-01,3,4,NaN
3,EMP1003,it,Analyst,45,35000,invalid,01/04/2021,1,3,NaN
4,NaN,IT,mgr,150,85000,NaN,invalid,12,2,True

In [4]:
df['joining_date'] = pd.to_datetime(df['joining_date'], errors='coerce' , format="mixed")

failed_count = df['joining_date'].isna().sum()
failed_count

np.int64(377)

In [7]:
df['joining_date'].unique()

<DatetimeArray>
['NaT', '2020-10-06 00:00:00', '2019-05-10 00:00:00', '2021-07-15 00:00:00']
Length: 4, dtype: datetime64[ns]

In [5]:
df['employee_id'] = (
    df['employee_id']
    .astype(str)
    .str.strip()
    .str.upper()
)

duplicate_count = df['employee_id'].duplicated().sum()
duplicate_count

np.int64(503)

In [9]:
df['employee_id'].head()

0    EMP1000
1      EMP_1
2    EMP1002
3    EMP1003
4        NAN
Name: employee_id, dtype: object

In [10]:
df['department'] = df['department'].astype(str).str.strip().str.upper()

df['salary'] = pd.to_numeric(df['salary'], errors='coerce')

avg_salary = df.groupby('department')['salary'].mean()
avg_salary

department
FINANCE    113253.012048
HR         114800.000000
IT         107944.444444
NAN        100000.000000
SALES      119000.000000
Name: salary, dtype: float64

In [12]:
df['age'] = pd.to_numeric(df['age'], errors='coerce')

result = df[df['salary'].notna() & df['age'].isna()]

result.head()

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
1,EMP_1,IT,Analyst,NaN,55000.0,2020-10-06,invalid,5,3,True
30,EMP1030,HR,Manager,NaN,85000.0,2019-05-10,invalid,3,3,True
31,NAN,HR,Analyst,NaN,55000.0,2020-10-06,2022-03-01,1,4,NaN
38,EMP_38,IT,Manager,NaN,35000.0,2021-07-15,2022-03-01,1,poor,True
45,NAN,FINANCE,NaN,NaN,120000.0,NaT,01/04/2021,1,1,yes

In [14]:
df['salary'] = pd.to_numeric(df['salary'], errors='coerce')

Q1 = df['salary'].quantile(0.25)
Q3 = df['salary'].quantile(0.75)
IQR = Q3 - Q1

lower = Q1 - 1.5 * IQR
upper = Q3 + 1.5 * IQR

outliers = df[(df['salary'] < lower) | (df['salary'] > upper)]
outliers.head()

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
11,NAN,SALES,mgr,22.0,250000.0,2021-07-15,NaN,NaN,5,yes
16,NAN,IT,NaN,60.0,250000.0,NaT,invalid,12,poor,no
25,NAN,SALES,NaN,28.0,250000.0,NaT,NaN,8,NaN,True
34,NAN,SALES,Analyst,45.0,250000.0,NaT,2022-03-01,-2,5,False
41,NAN,NAN,ANALYST,60.0,250000.0,2021-07-15,NaN,3,4,yes

In [15]:
df['performance_rating'] = pd.to_numeric(df['performance_rating'], errors='coerce')

median_rating = df.groupby('designation')['performance_rating'].median()
median_rating

designation
ANALYST           3.0
Analyst           3.0
Manager           3.0
Senior Analyst    3.0
mgr               3.0
Name: performance_rating, dtype: float64